correct = 0



print(" 問題1___の言葉の読み方として、最もよいものを1・2・3・4から一つ選びなさい。 ")

Q1 = int(input("1) 「先週」デパートに　かいものに　いきました。 \n 1.せんしゅ\n2.せんしゅう\n3.ぜんしゅ\n4.ぜんしゅう\n "))
if (Q1==2):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は2番です。")

Q2 = int(input("2) ごはんの「後」で　さんぽします。\n 1.つぎ \n 2.うしろ \n 3.まえ \n 4.あと\n"))
if (Q2==4):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は4番です。")

Q3 = int(input("3)もういちど　「言って」ください。 \n 1.いって \n 2.きって \n 3.まって \n 4.たって \n"))
if (Q3==1):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は1番です。")

Q4 = int(input("4) ちかくに　山があります。 \n 1.かわ \n 2.やま \n 3.いけ \n 4.うみ \n"))
if (Q4==2):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は2番です。")

Q5 = int(input("5) この　ホテル　は　へや　が　多い　です。 \n 1.すくない \n 2.おおい \n 3.せまい \n 4.ひろい \n"))
if (Q5==2):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は2番です。")

Q6 = int(input("6) ともだちと　いっしょに　「学校」に　いきます。\n 1.がこう \n 2.がこお \n 3.がっこう \n 4.がっこお \n"))
if (Q6==3):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は3番です。")

print("問題2 ( ) に入れるのに最もよいものを 1・2・3・4 から一つ選びなさい。")

Q7 = int(input("7)えんぴつ　が　「六本」あります。\n 1.ろくぼん \n 2.ろくぽん \n 3.ろっぼん \n 4.ろっぽん \n"))
if (Q7==4):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は4です。")

Q8 = int(input("8) この「新聞」はいくらですか。 \n 1.しんむん \n 2.しんぶん \n 3.しおん \n 4.しぶん \n"))
if (Q8==2):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は2番です。")

Q9 = int(input("9) このカメラは「安い」です。 \n 1.たかい \n 2.やすい \n 3.おもい \n 4.かるい \n"))
if (Q9==2):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は2番です。")

Q10 = int(input("10) かさ　は　「外」に　あります。 \n 1.いえ \n 2.なか \n 3.そと \n 4.にわ \n"))
if (Q10==3):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は3番です。")

Q11 = int(input("11) けさ　しゃわー　を　あびました。 \n 1.シャワー \n 2.シャウー \n 3.ツャワー \n 4.ツャウー \n"))
if (Q11==1):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は1番です。")

Q12 = int(input("12) コーヒー　を　「のみました」。\n 1.食みました \n 2.飲みました \n 3.飽みました \n 4.飯みました \n"))
if (Q12==2):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は2番です。")

Q13 = int(input("13) あたらしい　「くるま」を　かいました。 \n 1.卓 \n 2.草 \n 3.車 \n 4.早 \n"))
if (Q13==3):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は3番です。")
print(" 問題3___の言葉に意味が最も近いものを 1・2・3・4 から一つ選びなさい。 ")

Q14 = int(input("14)この　ぼうし　は　「1000えん」です。\n 1.1000千 \n 2.1000万 \n 3.1000冊 \n 4.1000円 \n"))
if (Q14==4):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は4番です。")

Q15 = int(input("15)しゅくだい　が　「はんぶん」おわりました。 \n 1.羊分 \n 2.半分 \n 3.羊文 \n 4.半文 \n"))
if (Q15==2):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は2番です。")

Q16 = int(input("16)わたし　の　うち　に　きませんか。 \n 1.来ませんか \n 2.末ませんか \n 3.木ませんか \n 4.未ませんか \n"))
if (Q16==1):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は1番です。")

Q17 = int(input("17) きのう　たなかさん　と　「あいました」 \n 1.見いました \n 2.書いました \n 3.会いました \n 4.話いました \n"))
if (Q17==3):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は3番です。")

Q18 = int(input("18)いもうと　と　「おなじ」ふく　を　かいました。\n  1.伺じ \n 2.回じ \n 3.四じ \n 4.同じ \n"))
if (Q18==4):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は4番です。")

Q19 = int(input("19)わたし　の　へや　は　この「　」の２かいです。 \n 1.エレベーター \n 2.プール \n 3.エアコン \n 4.アパート \n"))
if (Q19==4):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は4番です。")

print("問題4 次の言葉の使い方として、最もよいものを1・2・3・4から一つ選びなさい。")
Q20 = int(input("20) さとうさん　ギター　を　じょうず　に\n 1.うたいます。 \n 2.ききます。 \n 3.ひきます。 \n 4.あそびます。 \n"))
if (Q20==3):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は3番です。")

Q21 = int(input("21) テーブル　に　おさら　と　はし　を　「　」ください。\n 1.ならべて \n 2.とって \n 3.たべて \n 4.あらって \n"))
if (Q21==1):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は1番です。")

Q22 = int(input("22) けさ　そうじ　を　したから　へや　は　「　」です\n 1.きれい \n 2.きたない \n 3.あかるい \n 4.あかるい \n"))
if (Q22==1):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は1番です。")

Q23 = int(input("23) きょう　は　500「　」およぎました。\n 1.ど \n 2.ばん \n 3.メートル \n 4.グラム \n"))
if (Q23==3):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は3番です。")

Q24 = int(input("24) えき　から　たいしかん　までの　「　」を　かいてください。\n 1.しゃしん \n 2.ちず \n 3.てがみ \n 4.きっきっぷ \n"))
if (Q24==4):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は4番です。")

Q25 = int(input("25) うるさい　から　テレビ　を　「　」ください。\n 1.けして \n 2.つけて \n 3.しめて \n 4.あけて \n"))
if (Q25==1):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は1番です。")

print(" 問題5 次の文の（ ）に入れるのに最もよいものを、1・2・3・4から一つ選びなさい。 ")
Q26 = int(input(" 26) きょう　は　「　」が　ふっています。 \n 1.くもり \n 2.はれ \n 3.かぜ \n 4.ゆき \n"))
if (Q26==4):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は4番です。")

Q27 = int(input(" 27) はこ　に　りんご　が「５」あります。 \n 1.よっつ \n 2.いつつ \n 3.むっつ \n 4.ななつ \n"))
if (Q27==2):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は2番です。")

Q28 = int(input(" 28) めがね　は　つくえ　の「ＯＮＴＯＰ」にあります。 \n 1.そば \n 2.よこ \n 3.した \n 4.うえ \n"))
if (Q28==4):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は4番です。")

Q29 = int(input(" 29) 連休中どこにも出かけず、( )、今日は朝からどうも体がだるい。 \n 1.寝たことにしたせいか \n 2.寝てばかりいたせいか \n 3.寝たことにしたとすると \n 4.寝てばかりいたとすると \n"))
if (Q29==2):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は2番です。")

Q30 = int(input("30) (会議で)\n委員長「北駅周辺の再開発計画について、皆さんのご意見をお聞かせください。」\n委員「私個人( )その必要性を感じておりますが、市民の皆さんは納得しにくいのではないかと思います。」 \n 1.によりますと \n 2.といいますと \n 3.におかれましては \n 4.といたしましては \n"))
if (Q30==4):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は4番です。")

Q31 = int(input("31) せっかく新しく買うのならと高性能のパソコンを( )、全く使いこなせていない。\n 1.買ったばかりでも \n 2.買ったはいいが \n 3.買ったかにかかわらず \n 4.買ったきりなのに \n"))
if (Q31==2):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は2番です。")

Q32 = int(input(" 32) 先日、レストランに行ったとき、店員の失礼な態度に大変( )。 \n 1.不快な思いをした。 \n 2.不快極まりない \n 3.不快だったことか \n 4.不快にもほどがある \n"))
if (Q32==1):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は1番です。")

Q33 = int(input("33) (会社で)\林: 「部長、ABC銀行の山下さんが( )。応接室でお待ちです。」\n部長: 「わかりました。」 \n 1.参りました \n 2.見えました \n 3.うかがいました \n 4.お目にかかりました \n"))
if (Q33==2):
    print("正解です！")
    correct = correct+1
else:
    print("申し訳ございません、正解は2番です。")





print(correct)
score = (correct/33)*100
print("Score: ", score)