print(" 問題1___の言葉の読み方として、最もよいものを1・2・3・4から一つ選びなさい。 ")

Q1 = int(input("(1) ある画家の人生の「軌跡」を描いた映画を見た。 \n 1.きぜき\n2.きせき\n3.きゅうぜき\n4.きゅうせき\n "))
if (Q1==2):
    print("正解です！")
else:
    print("申し訳ございません、正解は2番です。")

Q2 = int(input("(2) ここに書いてある情報には「偏り」がある\n 1.へだたり \n 2.かたより \n. 3.あやまり \n 4.こだわり\n"))
if (Q2==2):
    print("正解です！")
else:
    print("申し訳ございません、正解は2番です。")

Q3 = int(input("(3)村上氏の主張にはさまざまな「矛盾」が含まれている \n 1.むじゅん \n 2.むじゅう \n 3.みじゅん \n 4.みじゅう \n"))
if (Q3==1):
    print("正解です！")
else:
    print("申し訳ございません、正解は1番です。")

Q4 = int(input("(4) 事実が「誇張」されて伝わる \n 1.こうちょう \n 2.ごちょう \n 3.こちょう \n 4.ごうちょう \n"))
if (Q4==3):
    print("正解です！")
else:
    print("申し訳ございません、正解は3番です。")

Q5 = int(input("(5) この食堂で社員全員の昼食を「賄っている」。 \n 1.ふるまって \n 2.になって \n 3.あつかって \n 4.まかなって \n"))
if (Q5==4):
    print("正解です！")
else:
    print("申し訳ございません、正解は4番です。")

Q6 = int(input("(6) 「軽率な」行動が批判を招いた。\n 1.けいそつ \n 2.けいりつ \n 3.かいそつ \n 4.かいりつ \n"))
if (Q6==1):
    print("正解です！")
else:
    print("申し訳ございません、正解は1番です。")

print("問題2 ( ) に入れるのに最もよいものを 1・2・3・4 から一つ選びなさい。")

Q7 = int(input("(7)そのチームは、名門チームが多数出場する中で、初出場で優勝という( )を成し遂げた。\n 1.好況 \n 2.喜劇 \n 3.快挙 \n 4.繁栄 \n"))
if (Q7==3):
    print("正解です！")
else:
    print("申し訳ございません、正解は3です。")

Q8 = int(input(" (8) リーダーの無責任な発言が、混乱をさらに( )することになった。 \n 1.助長 \n 2.拡充 \n 3.主導 \n 4.催促 \n"))
if (Q8==1):
    print("正解です！")
else:
    print("申し訳ございません、正解は1番です。")

Q9 = int(input(" (9) 誰かを助けてあげたからといって、その分の( )を求めてはいけない。 \n 1.仕返し \n 2.見返り \n 3.返却 \n 4.返済 \n"))
if (Q9==2):
    print("正解です！")
else:
    print("申し訳ございません、正解は2番です。")

Q10 = int(input(" (10) 学内から選ばれた学生たちによって、代表チームが( )された。 \n 1.集約 \n 2.結合 \n 3.結成 \n 4.採集 \n"))
if (Q10==3):
    print("正解です！")
else:
    print("申し訳ございません、正解は3番です。")

Q11 = int(input(" (11) 飛行機やホテルの予約、関係者との日程調整など、出張の( )はすべて秘書に任せている。 \n 1.手配 \n 2.始末 \n 3.実施 \n 4.整備 \n"))
if (Q11==1):
    print("正解です！")
else:
    print("申し訳ございません、正解は1番です。")

Q12 = int(input("(12) 入院生活をして、健康の大切さを( )感じた。\n 1.めきめき \n 2.せいぜい \n 3.はきはき \n 4.つくづく \n"))
if (Q12==4):
    print("正解です！")
else:
    print("申し訳ございません、正解は4番です。")

Q13 = int(input(" (13) 高木さんは入社当初は表情が硬かったが、だんだん緊張が( )きたらしく、笑顔を見せるようになった。 \n 1.かすれて \n 2.はがれて \n 3.くずれて \n 4.ほぐれて \n"))
if (Q13==4):
    print("正解です！")
else:
    print("申し訳ございません、正解は4番です。")
print(" 問題3___の言葉に意味が最も近いものを 1・2・3・4 から一つ選びなさい。 ")

Q14 = int(input("(14) 自分の「尺度」を持ったほうがいい。\n 1.理想 \n 2.意思 \n 3.基準 \n 4.専門 \n"))
if (Q14==3):
    print("正解です！")
else:
    print("申し訳ございません、正解は3番です。")

Q15 = int(input("(15) 「わずらわしい」仕事をやることになってしまった。 \n 1.退屈な \n 2.面倒な \n 3.危険な \n 4.余計な \n"))
if (Q15==2):
    print("正解です！")
else:
    print("申し訳ございません、正解は2番です。")

Q16 = int(input(" (16) 池田さんには会えたが、「肝心な」話はできなかった。 \n 1.個人的な \n 2.具体的な \n 3.詳細な \n 4.重要な \n"))
if (Q16==4):
    print("正解です！")
else:
    print("申し訳ございません、正解は4番です。")

Q17 = int(input("(17) 今週は仕事が「はかどりました。」 \n 1.順調に進みました \n 2.大幅に遅れました \n 3.徐々に減りました \n 4.急激に増えました \n"))
if (Q17==1):
    print("正解です！")
else:
    print("申し訳ございません、正解は1番です。")

Q18 = int(input(" (18) 新人のときはずっと「辛抱」していた \n 1.苦労 \n 2.我慢 \n 3.失敗 \n 4.心配 \n"))
if (Q18==2):
    print("正解です！")
else:
    print("申し訳ございません、正解は2番です。")

Q19 = int(input(" 19) この地方の「しきたり」について話を聞いた。 \n 1.名物 \n 2.気候 \n 3.慣習 \n 4.歴史 \n"))
if (Q19==3):
    print("正解です！")
else:
    print("申し訳ございません、正解は3番です。")

print("問題4 次の言葉の使い方として、最もよいものを1・2・3・4から一つ選びなさい。")
Q20 = int(input("20) 解約\n 1.道路工事が終了したので、車両の通行止めを解約した。 \n 2.暗証番号を入力して、ドアのロックを解約してください。 \n 3.体調が悪いので、友達と食事に行く予定を解約した。 \n 4.家計の見直しをして、保険を解約することにした。 \n"))
if (Q20==4):
    print("正解です！")
else:
    print("申し訳ございません、正解は4番です。")

Q21 = int(input("21) 特産\n 1.これはあの監督の数々の作品の中でも特産の映画だと思う。 \n 2.村の特産の黄色いリンゴを使った料理をごちそうになった。 \n 3.彼は我が国の特産の世界的なサッカー選手で、彼のことを知らない人はいない。 \n 4.わが社特産の技術を生かした新商品を開発する。 \n"))
if (Q21==2):
    print("正解です！")
else:
    print("申し訳ございません、正解は2番です。")

Q22 = int(input("22) 問い詰める\n 1.石川さんは数学ができるから、いつもみんなに数学の問題を問い詰められている。 \n 2.進路について一人で問い詰めていたが、両親に相談することにした。 \n 3.子供のころから星を見るのが大好きで、今も宇宙の謎を問い詰めている。 \n 4.友達たちから、どうして約束を破ったのか問い詰められた。 \n"))
if (Q22==4):
    print("正解です！")
else:
    print("申し訳ございません、正解は4番です。")

Q23 = int(input("23) 改修\n 1.顔の大きさに合わせて、眼鏡を改修してもらった。 \n 2.問題の解決には、法律を改修しなければならない。 \n 3.台風によって壊れてしまった橋を改修している。 \n 4.この資料は古いので、デーマを改修してください。 \n"))
if (Q23==3):
    print("正解です！")
else:
    print("申し訳ございません、正解は3番です。")

Q24 = int(input("(24) 手厚い\n 1.大切なお客様がいらっしゃったので、手厚くもてなした。 \n 2.交差点で起きた交通事故の状況を警察に手厚く説明した。 \n 3.この商品は壊れやすいので、袋に包んで手厚く運んだ。 \n 4.寝ている赤ちゃんを起こさないように、ドアを手厚く閉めた。 \n"))
if (Q24==1):
    print("正解です！")
else:
    print("申し訳ございません、正解は1番です。")

Q25 = int(input("25) デマ\n 1.誰かがデマを流して、私たちをだまそうとしている。 \n 2.この絵画はデマで、本物は市の美術館で見られます。 \n 3.山本さんは年上だと思っていたが、私のデマだった。 \n 4.二人できちんと話し合って、お互いのデマを解いた。 \n"))
if (Q25==1):
    print("正解です！")
else:
    print("申し訳ございません、正解は1番です。")

print(" 問題5 次の文の（ ）に入れるのに最もよいものを、1・2・3・4から一つ選びなさい。 ")
Q26 = int(input(" 26) 長く使っていた古い冷蔵庫を、引っ越し( )買い替えた。 \n 1.を機に \n 2.を皮切りにい \n 3.に基づいて \n 4.にわたって \n"))
if (Q26==1):
    print("正解です！")
else:
    print("申し訳ございません、正解は1番です。")

Q27 = int(input(" 27) 経営者は、会社は社員( )ものであるということを忘れてはいけない。 \n 1.たる \n 2.における \n 3.あっての \n 4.ならではの \n"))
if (Q27==3):
    print("正解です！")
else:
    print("申し訳ございません、正解は3番です。")

Q28 = int(input(" 28) 私はこの漫画が大好きで、つらいときに( )元気をもらっている。 \n 1.読み返すべく \n 2.読み返すならば \n 3.読み返しては \n 4.読み返してこそ \n"))
if (Q28==3):
    print("正解です！")
else:
    print("申し訳ございません、正解は3番です。")

Q29 = int(input(" 29) 連休中どこにも出かけず、( )、今日は朝からどうも体がだるい。 \n 1.寝たことにしたせいか \n 2.寝てばかりいたせいか \n 3.寝たことにしたとすると \n 4.寝てばかりいたとすると \n"))
if (Q29==2):
    print("正解です！")
else:
    print("申し訳ございません、正解は2番です。")

Q30 = int(input("30) (会議で)\n委員長「北駅周辺の再開発計画について、皆さんのご意見をお聞かせください。」\n委員「私個人( )その必要性を感じておりますが、市民の皆さんは納得しにくいのではないかと思います。」 \n 1.によりますと \n 2.といいますと \n 3.におかれましては \n 4.といたしましては \n"))
if (Q30==4):
    print("正解です！")
else:
    print("申し訳ございません、正解は4番です。")

Q31 = int(input("31) せっかく新しく買うのならと高性能のパソコンを( )、全く使いこなせていない。\n 1.買ったばかりでも \n 2.買ったはいいが \n 3.買ったかにかかわらず \n 4.買ったきりなのに \n"))
if (Q31==2):
    print("正解です！")
else:
    print("申し訳ございません、正解は2番です。")

Q32 = int(input(" 32) 先日、レストランに行ったとき、店員の失礼な態度に大変( )。 \n 1.不快な思いをした。 \n 2.不快極まりない \n 3.不快だったことか \n 4.不快にもほどがある \n"))
if (Q32==1):
    print("正解です！")
else:
    print("申し訳ございません、正解は1番です。")

Q33 = int(input("33) (会社で)\林: 「部長、ABC銀行の山下さんが( )。応接室でお待ちです。」\n部長: 「わかりました。」 \n 1.参りました \n 2.見えました \n 3.うかがいました \n 4.お目にかかりました \n"))
if (Q33==2):
    print("正解です！")
else:
    print("申し訳ございません、正解は2番です。")

Q34 = int(input(" 34) 今日から12月だ。早いもので、今年ももうすぐ( )。 \n 1.終ろうとする \n 2.終るようにする \n 3.終ろうとしている \n 4.終るようにしている \n"))
if (Q34==2):
    print("正解です！")
else:
    print("申し訳ございません、正解は2番です。")

Q35 = int(input(" 35) 仕事において、ミスは( )。しかし、人間である以上、ミスは避けられないものだ。 \n 1.してはいけないわけがない \n 2.してはいけないはずだった \n 3.しないほうがいいとは限らない \n 4.しないほうがいいに決まっている \n"))
if (Q35==4):
    print("正解です！")
else:
    print("申し訳ございません、正解は4番です。")
